app/controllers/actors_controller.rb

SELECT "actors".* FROM "actors" WHERE "actors"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @actor = Actor.find(params[:id])